Revit 2027 API
MEPBuildingConstructionSet.Insert Method
Insert the specified MEPBuildingConstruction into the set.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	MEPBuildingConstruction item
)
Public Overridable Function Insert (
	item As MEPBuildingConstruction
) As Boolean
public:
virtual bool Insert(
	MEPBuildingConstruction^ item
)
abstract Insert :
        item : MEPBuildingConstruction -> bool
override Insert :
        item : MEPBuildingConstruction -> bool
Parameters
item MEPBuildingConstruction
The MEPBuildingConstruction to be inserted into the set.
Return Value
Boolean
Returns whether the MEPBuildingConstruction was inserted into the set.
See Also
Reference
MEPBuildingConstructionSet Class
Autodesk.Revit.DB.Mechanical Namespace